posts/projects.org
#+TITLE: Projects
#+DATE: <2019-05-21 Tue>

* magit-diff-flycheck :EmacsLisp:2019:
Interactive tool for lint output in Git diffs.
- [[https://github.com/ragone/magit-diff-flycheck][GitHub]]
- [[https://melpa.org/#/magit-diff-flycheck][Melpa.org]]
* lint-emit :Rust:2019:
Command-line utility to run concurrent linters on a subset of lines.
- [[https://github.com/ragone/lint-emit][GitHub]]
- [[https://crates.io/crates/lint-emit/crates.io][Crates.io]]
* QuietMind :ReactNative:2018:
A silent meditation tool for iOS and Android.
- [[https://github.com/ragone/quietmind][GitHub]]
- [[https://itunes.apple.com/dk/app/quietmind/id1375294277][Apple App Store]]
- [[https://play.google.com/store/apps/details?id=ragone.io.quietmind][Google Play Store]]
* Emacs Config :EmacsLisp:2016:
Personal configuration based on Doom Emacs.
- [[https://github.com/ragone/.doom.d][GitHub]]
