projects.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://ragone.io/rss.xml"
      title="RSS feed for https://ragone.io/"/>
<title>Projects</title>
<meta  name="author" content="ragone" />
      <link href= "static/style.css" rel="stylesheet" type="text/css" />
      <link href= "static/htmlize.css" rel="stylesheet" type="text/css" />
      <meta http-equiv="content-type" content="application/xhtml+xml; charset=UTF-8" />
      <meta name="viewport" content="initial-scale=1,width=device-width,minimum-scale=1"></head>
<body>
<div id="preamble" class="status">
<div class="header">
        <a href="https://ragone.io">Alex Ragone - Web Developer</a>
      </div></div>
<div id="content">
<div class="headline"> <h1 class="post-title"><a href="projects.html">Projects</a></h1>
</div>
<div id="outline-container-org17e2c27" class="outline-2">
<h2 id="org17e2c27">magit-diff-flycheck&#xa0;&#xa0;&#xa0;<span class="tag"><span class="EmacsLisp">EmacsLisp</span>&#xa0;<span class="2019">2019</span></span></h2>
<div class="outline-text-2" id="text-org17e2c27">
<p>
Interactive tool for lint output in Git diffs.
</p>
<ul class="org-ul">
<li><a href="https://github.com/ragone/magit-diff-flycheck">GitHub</a></li>
<li><a href="https://melpa.org/#/magit-diff-flycheck">Melpa.org</a></li>
</ul>
</div>
</div>
<div id="outline-container-orga4c5b54" class="outline-2">
<h2 id="orga4c5b54">lint-emit&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Rust">Rust</span>&#xa0;<span class="2019">2019</span></span></h2>
<div class="outline-text-2" id="text-orga4c5b54">
<p>
Command-line utility to run concurrent linters on a subset of lines.
</p>
<ul class="org-ul">
<li><a href="https://github.com/ragone/lint-emit">GitHub</a></li>
<li><a href="https://crates.io/crates/lint-emit/crates.io">Crates.io</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgf31e99e" class="outline-2">
<h2 id="orgf31e99e">QuietMind&#xa0;&#xa0;&#xa0;<span class="tag"><span class="ReactNative">ReactNative</span>&#xa0;<span class="2018">2018</span></span></h2>
<div class="outline-text-2" id="text-orgf31e99e">
<p>
A silent meditation tool for iOS and Android.
</p>
<ul class="org-ul">
<li><a href="https://github.com/ragone/quietmind">GitHub</a></li>
<li><a href="https://itunes.apple.com/dk/app/quietmind/id1375294277">Apple App Store</a></li>
<li><a href="https://play.google.com/store/apps/details?id=ragone.io.quietmind">Google Play Store</a></li>
</ul>
</div>
</div>
<div id="outline-container-org844228b" class="outline-2">
<h2 id="org844228b">Emacs Config&#xa0;&#xa0;&#xa0;<span class="tag"><span class="EmacsLisp">EmacsLisp</span>&#xa0;<span class="2016">2016</span></span></h2>
<div class="outline-text-2" id="text-org844228b">
<p>
Personal configuration based on Doom Emacs.
</p>
<ul class="org-ul">
<li><a href="https://github.com/ragone/.doom.d">GitHub</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status"><div id="archive">
        <a href="archive.html">archive</a>
      </div>
      <center>
        <p>Find me on <a title="LinkedIn" href="https://www.linkedin.com/in/alex-ragone" target="_blank" rel="noopener">LinkedIn</a> or <a title="Github" href="https://github.com/ragone" target="_blank" rel="noopener">Github</a>!</p>
      </center></div>
</body>
</html>
